{"pages":[{"url":"http://chunshan.github.io/about.html","text":"我是小屌丝一个。目前在UIH工作，负责MRI后处理应用的开发。","tags":"pages","title":"About"},{"url":"http://chunshan.github.io/misc/year-end-summaray-2015-2016.html","text":"2015年第一天早上看到的新闻是上海外滩跨年活动踩踏事件，伴随着对前一天晚上去参加跨年活动的小舅子的担心去了南京，参加一个同学的婚礼，由此揭开了2015年的盖头。转眼间，2015年已经到了最后一天，是揭2016年盖头的时候了。 2015年最幸福的事莫过于女儿扬扬（杨林曦）的出生，我们的小家有了新生命的参与。虽然照顾孩子确实是件辛苦的事，每天晚上下班回家得逗她玩儿，给她洗澡，换尿布，喂奶粉，哄睡觉；夜里至少还要醒一两次，往往在我跟老婆睡得最香甜的时候，又要给她喂奶或者抱起来轻拍哄睡；每天早上又要给她洗脸，洗屁屁，穿衣服，冲奶粉。要是小家伙偶尔不舒服更是让人更添一份担心。总之有了小（XIAO）家（GONG）伙（ZHU），家里所有人都得围着她转，丈母娘从老家来了又回去，老妈也从老家来了回去又回来，家里的电视几乎没时间打开，我坚持的跑步运动也几乎放弃了，还为了她买辆车。但是看着孩子一天天长大，看着她第一次翻身，第一次自己拿奶瓶喝水，第一次笑出声来，第一次学着大人讲话发出\"MaMa\"\"BaBa\"的声音，心里由衷感到高兴，辛苦并快乐着。为了我们延续的生命，一切都是值得的。 2015年最痛苦的事莫过于爷爷的去世。爷爷1929年出生，很小的时候被土匪绑架过，命大不死，读过私塾，14岁结婚，16岁当爹，1951年入党，1953年还当过我们普通乡（现在已经被邵庄镇合并）的第一任乡长，后来因我曾祖父的牵连被撤下。三年自（REN）然（HUO）灾害期间，爷爷带领一家老小8口人去东北大兴安岭伐木，使得一家人都没在惨绝人寰的饥荒中饿死，后来山东情况好转，又带领一家老小回到青州。奶奶去世后，爷爷先后看守过炸药库，村里大队的大院，村里的小学，共二十几年。爷爷一生耿直，酷爱读书，还练过气功，不同年龄阶段的朋友很多，儿时的印象中很少下地干活，如闲云野鹤。据说曾经有人给他算卦，说他儿时克母，中年克妻，老年克子，竟不幸言中，一一应验，更可悲三四年前他自己也患上阿尔茨海默病（老年痴呆症），神智逐渐不清，今年他的生日（农历8月24）恰逢国庆节假期，回去给他过生日，连我也完全不认得了，卧床不能自理，身上褥疮一块一块，受罪极深。爷爷虽不能跨过2016的元旦，这样猝然离去对他而言也是一种解脱，少在人间受罪。他虽不擅言语表达（后来也不能言语表达），估计他也时常想起他自己坎坷的一生而悲愤不已。他曾经作过一首诗，竟也是他晚年生活的真实写照。愿爷爷安息，在那边继续闲云野鹤地过下去。 2015年还去参加过苏州半程马拉松比赛，全程跑下，虽然成绩一般，也算是对自己的一次挑战。等娃稍微大点儿，我会继续跑下去，向着全马努力。 2015年个人技能上算是对Python这门语言系统学习了一下，也写了一些东西，但还远谈不上精通。2015年与一个同事做验证码识别的小项目，工作之余忙活了大约两个月，虽小有成果，但半途而废。2015年在机器学习知识上仍然是浅尝辄止，未曾深入。 2015年工作上技能的长进主要在磁共振相关领域知识上，通读了两遍《深入理解MRI基础》，只能算是刚刚入了门，9月份开始翻译 Questions and Answers in MRI 上的文章，并在Github上建立项目站点 MRI-QA 将翻译的文章更新上去，在2015年结束的时候才将DSC，DCE和ASL共约30篇文章翻译完，2016年会继续这一进程，争取将更多的文章翻译出来。 2015年的股票投资乏善可陈。2014年就开始对财务报表断断续续的学习，2015年仍然没有什么进步。2015年投资上最大的收获应该是初步了解了分级A基金和分级B基金，而且亲身经历了2015年巨幅震荡的股市，对涨跌更加淡定，也更加坚定了价值投资的理念。但是距离有自己的投资体系还差得很远。虽然2015年还曾想用Python试着写简单的量化投资工具，刚开了个头就发现 集思录 这个网站已经把我想到的都完成了，想法直接胎死腹中。 2016年计划读10+本书，已经在书单中有《创业维艰》，《格鲁夫给经理人的第一课》，《手把手教你读财报》，《价值的魔法》，《深入理解MRI基础》（第三遍），《怪诞行为学》，《重构，改善既有代码的设计》。听三门网易公开课。争取将 Questions and Answers in MRI 翻译一半以上。 立此存照，看看2016年能完成多少。","tags":"Misc","title":"2015总结，2016计划"},{"url":"http://chunshan.github.io/misc/restructuredtext_de_shi_yong_shi_yan.html","text":"这是在Github上建站后的第二篇文章，这篇文章用于展示reStructuredText的一些基本用法，如标题，图片，表格，数学公式等，实验之后再用到博客其他文章中。 标题 Conservation of mass and energy 文字样式 斜体 I Love Shanghai 粗体 I Love Shanghai 列表 第一条 第二条 小条 第三条 嵌入程序代码 1 2 3 def foo (): print \"Love Python, Love FreeDome\" print \"E文标点,.0123456789,中文标点,. \" 表格 Frozen Delights! Treat Quantity Description Albatross 2.99 On a stick! Crunchy Frog 1.49 If we took the bones out, it wouldn't be crunchy, now would it? Gannet Ripple 1.99 On a stick! 图片 Simple model of regional circulation T2加权像，显示胼胝体上的脑肿瘤 显著升高的BV，高度恶性的成胶质细胞瘤 超链接 Paul Allen Tipler, Ralph A. Llewellyn (2003-01), \"Modern Physics\" , W. H. Freeman and Company, pp. 87–88, ISBN 0-7167-4345-0","tags":"Misc","title":"reStructuredText的使用试验"},{"url":"http://chunshan.github.io/misc/zhe-shi-wo-bo-ke-minddemonsde-di-yi-pian-wen-zhang.html","text":"Hello Pelican! Hello reStructuredText! Hello Github! 这是我在Github上使用 Pelican 建站后的第一篇文章，此博客作为个人主页，分享自己对编码，医学图像处理，软件项目管理等的一些看法，尽量原创。 博客上的文章使用简单文本标记语言reStructuredText书写。 Github上的另一个博客 磁共振知识问答 翻译网站 Questions and Answers in MRI 上的部分文章。","tags":"Misc","title":"这是我博客MindDemons的第一篇文章"}]}